In [1]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [3]:
# Read sqlite query results into a pandas DataFrame
coordinate_df = pd.read_sql_query('SELECT * from coordinate_table',conn)
coordinate_df.head()

   index State   Latitude   Longitude        City
0      0    AL  32.601011  -86.680736     Alabama
1      1    AK  61.302501 -158.775020      Alaska
2      2    AZ  34.168219 -111.930907     Arizona
3      3    AR  34.751928  -92.131378    Arkansas
4      4    CA  37.271875 -119.270415  California

# Northeast Center Coordinates

In [15]:
# Read sqlite query results into a pandas DataFrame
ne_df = pd.read_sql_query("""SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('CT', 'ME', 'MA', 'NH', 'RI', 'VT', 'NJ', 'NY', 'PA')
""",conn);

ne_df

    Latitude  Longitude
0  42.233242 -72.815566

# Midwest Center Coordinates

In [16]:
# Read sqlite query results into a pandas DataFrame
mw_df = pd.read_sql_query("""SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('IL', 'IN', 'MI', 'OH', 'WI', 'IA', 'KS', 'MN', 'MS', 'NE', 'ND', 'SD')
""",conn);

mw_df

    Latitude  Longitude
0  41.839268 -92.503343

# South Center Coordinates

In [17]:
# Read sqlite query results into a pandas DataFrame
s_df = pd.read_sql_query("""SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('DE', 'FL', 'GA', 'MD', 'NC', 'SC', 'VA', 'DC', 'WV', 'AL', 'KY', 'MS', 'TN', 'AR', 'LA', 'OK', 'TX')
""",conn);

s_df

    Latitude  Longitude
0  34.959489 -85.170362

# West Center Coordinates

In [18]:
# Read sqlite query results into a pandas DataFrame
wc_df = pd.read_sql_query("""SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('AZ', 'CO', 'ID', 'MT', 'NV', 'NM', 'UT', 'WY', 'AK', 'CA', 'HI', 'OR', 'WA')
""",conn);

wc_df

    Latitude   Longitude
0  40.198808 -116.686347

# Combine Dataframe

In [30]:
# Read sqlite query results into a pandas DataFrame
us_div_coordinate_df = pd.read_sql_query("""SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('CT', 'ME', 'MA', 'NH', 'RI', 'VT', 'NJ', 'NY', 'PA')

union

SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('IL', 'IN', 'MI', 'OH', 'WI', 'IA', 'KS', 'MN', 'MS', 'NE', 'ND', 'SD')

union

SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('DE', 'FL', 'GA', 'MD', 'NC', 'SC', 'VA', 'DC', 'WV', 'AL', 'KY', 'MS', 'TN', 'AR', 'LA', 'OK', 'TX')

union

SELECT
AVG(Latitude) as Latitude,
AVG(Longitude) as Longitude

from coordinate_table

where State in ('AZ', 'CO', 'ID', 'MT', 'NV', 'NM', 'UT', 'WY', 'AK', 'CA', 'HI', 'OR', 'WA')


""",conn);

us_div_coordinate_df

    Latitude   Longitude
0  34.959489  -85.170362
1  40.198808 -116.686347
2  41.839268  -92.503343
3  42.233242  -72.815566

In [32]:
# Add division column to dataframe
division = ['northeast', 'midwest', 'south', 'west']
us_div_coordinate_df['division'] = division

# Reorder by column name
us_div_coordinate_df = us_div_coordinate_df[['division', 'Latitude', 'Longitude']]
us_div_coordinate_df

    division   Latitude   Longitude
0  northeast  34.959489  -85.170362
1    midwest  40.198808 -116.686347
2      south  41.839268  -92.503343
3       west  42.233242  -72.815566